AccumulationRegisters/ПрочиеДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеДоходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистраторРасчетаСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗакрытияМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыЗакрытияМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаДоходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияНеоперативногоДопроведенияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНеоперативногоДопроведенияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНеоперативныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/УдалитьПрочиеДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>УдалитьПрочиеДоходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистраторРасчетаСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗакрытияМесяца</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыЗакрытияМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаДоходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиДоходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПрочиеДоходы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Собирает структуру из текстов запросов для дальнейшей проверки даты запрета.
// 
// Параметры:
// 	Запрос - Запрос - Запрос по проверке даты запрета, можно установить параметры
// Возвращаемое значение:
// 	Структура - см. ЗакрытиеМесяцаСервер.ИнициализироватьСтруктуруТекстовЗапросов
Функция ТекстЗапросаКонтрольДатыЗапрета(Запрос) Экспорт
	ИмяРегистра = Метаданные.РегистрыНакопления.ПрочиеДоходы.Имя;
	ИмяТаблицыИзменений = "ТаблицаИзмененийПрочиеДоходы"; 
	СтруктураТекстовЗапросов = ПроведениеДокументов.ШаблонТекстЗапросаКонтрольДатыЗапрета(Запрос, 
		ИмяРегистра, 
		ИмяТаблицыИзменений, 
		"ФинансовыйКонтур");
	Возврат СтруктураТекстовЗапросов

КонецФункции

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
	
КонецПроцедуры

// Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполняет параметры отражения движений регистра в финансовом учете
//
// Параметры:
//  МетаданныеРегистра - ОбъектМетаданныхРегистрНакопления - Метаданные регистра накопления
//  РегистрацияКОтражению - Булево - Признак получения параметров для регистрации к отражению в учете
//
// Возвращаемое значение:
// 	см. ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете
//
Функция ПараметрыОтраженияДвиженийВФинансовомУчете(МетаданныеРегистра = Неопределено, РегистрацияКОтражению = Ложь) Экспорт
	
	ПараметрыОтражения = ФинансовыйУчетПоДаннымБалансовыхРегистров.ПараметрыОтраженияДвиженийВФинансовомУчете(РегистрацияКОтражению);
	
	Если РегистрацияКОтражению Тогда
		Возврат ПараметрыОтражения;
	КонецЕсли;
	
	ПараметрыОтражения.ПутьКДаннымОбъектНастройки = "СтатьяДоходов.ГруппаФинансовогоУчета";
	ПараметрыОтражения.ПутьКДаннымМестоУчета = "Подразделение";
	ПараметрыОтражения.ПутьКДаннымНаправлениеДеятельности = "НаправлениеДеятельности";
	ПараметрыОтражения.ПутьКДаннымПодразделение = "Подразделение";
	ПараметрыОтражения.РесурсыУпр.Добавить("СуммаУпр");
	ПараметрыОтражения.РесурсыРегл.Добавить("СуммаРегл");
	
	
	ПараметрыОтражения.УсловиеДебет = "ЛОЖЬ";
	ПараметрыОтражения.УсловиеКредит = "ИСТИНА";
	
	Если МетаданныеРегистра = Неопределено Тогда
		МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	КонецЕсли;
	
	ФинансовыйУчетПоДаннымБалансовыхРегистров.ЗаполнитьПараметрыОтраженияПоМетаданнымРегистра(ПараметрыОтражения, МетаданныеРегистра);
	
	Возврат ПараметрыОтражения;
	
КонецФункции

#КонецОбласти

#Область НеоперативнаяОчередьЗаданий

// Данные к формированию заданий неоперативного допроведения документов.
// Вызывается при записи набора записей регистра.
// 
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей, РегистрСведенийНаборЗаписей - Записываемый набор записей регистра - источника.
//  ВидыЗаданий - Массив Из СправочникСсылка.ВидыНеоперативныхЗаданий - Список видов заданий.
//                По данному списку должны зарегистрироваться новые задания согласно записываемым данным регистра.
//  МенеджерВременныхТаблиц - Неопределено, МенеджерВременныхТаблиц - При указании МВТ данные временных таблиц будут использованы при формировании новых заданий.
//  ДанныеКРегистрацииЗаданий - Неопределено, ТаблицаЗначений - Таблица с данными к регистрации новых заданий.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные к формированию заданий неоперативного допроведения документов:
// * Организация - СправочникСсылка.Организации - Организация, по которой будет сформировано новое задание.
// * ПериодЗадания  - Дата - Период задания. Совпадает с периодом записываемых данных в регистре.
// * Документ - ДокументСсылка - Ссылка на документ, по которому будет зарегистрировано задание.
// * ВидЗадания - СправочникСсылка.ВидыНеоперативныхЗаданий - Вид регистрируемого задания.
//
Функция ДанныеКФормированиюЗаданийНеоперативногоДопроведенияДокументов(НаборЗаписей, ВидыЗаданий,
	МенеджерВременныхТаблиц = Неопределено, ДанныеКРегистрацииЗаданий = Неопределено) Экспорт
	
	Если Не ДанныеКРегистрацииЗаданий = Неопределено Тогда
		Возврат ДанныеКРегистрацииЗаданий;
	КонецЕсли;
	
	ТаблицаДанных = РегистрыСведений.ЗаданияНеоперативногоДопроведенияДокументов.ТаблицаФормированияЗаданий();
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ПрочиеДоходы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.35";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e8ea5d4b-ae61-4d81-a34e-ce03ce438a26");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ПрочиеДоходы.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = НСтр("ru = 'Заполняет регистр ""Прочие доходы"" по данным регистра ""(Не используется) Прочие доходы"".'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.УдалитьПрочиеДоходы.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.ПрочиеДоходы.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.УдалитьПрочиеДоходы.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.ПрочиеДоходы.ОбработатьДанныеДляПереходаНаНовуюВерсию_ЗаданияКЗакрытиюМесяца";
	Обработчик.Версия = "11.5.26.61";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("40473867-7bfa-4291-9ff5-147d8c5c5e64");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ПрочиеДоходы.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_ЗаданияКЗакрытиюМесяца";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Обработчик.Комментарий = НСтр("ru = 'Создает задания к закрытию месяца по данным регистра ""Прочие доходы"".';");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.УдалитьПрочиеДоходы.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.ЗаданияКЗакрытиюМесяца.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыНакопления.УдалитьПрочиеДоходы.ПолноеИмя());
	Блокируемые.Добавить(Метаданные.РегистрыСведений.ЗаданияКЗакрытиюМесяца.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра	= "РегистрНакопления.УдалитьПрочиеДоходы";
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УдалитьПрочиеДоходы.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.УдалитьПрочиеДоходы КАК УдалитьПрочиеДоходы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеДоходы КАК ПрочиеДоходы
	|		ПО УдалитьПрочиеДоходы.Регистратор = ПрочиеДоходы.Регистратор
	|ГДЕ
	|	ПрочиеДоходы.Регистратор ЕСТЬ NULL
	|	И НЕ (УдалитьПрочиеДоходы.Регистратор ССЫЛКА Документ.РаспределениеДоходовПоНаправлениямДеятельности
	|		И УдалитьПрочиеДоходы.НаправлениеДеятельности = УдалитьПрочиеДоходы.КорНаправлениеДеятельности)
	|";
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяРегистра);
	
КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_ЗаданияКЗакрытиюМесяца(Параметры) Экспорт
	
	ПолноеИмяРегистра	= Метаданные.РегистрыСведений.ЗаданияКЗакрытиюМесяца.ПолноеИмя();
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", ПолноеИмяРегистра);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрочиеДоходыОбороты.Период КАК Месяц,
	|	ЗНАЧЕНИЕ(Справочник.ОперацииЗакрытияМесяца.РаспределениеДоходовПоНаправлениямДеятельности) КАК Операция,
	|	ПрочиеДоходыОбороты.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.УдалитьПрочиеДоходы.Обороты(, , Месяц, ) КАК ПрочиеДоходыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаБлокировкиОтИзменений КАК НастройкаБлокировкиОтИзменений
	|		ПО ПрочиеДоходыОбороты.Период >= НастройкаБлокировкиОтИзменений.ЗаблокироватьПо
	|			И ПрочиеДоходыОбороты.Организация = НастройкаБлокировкиОтИзменений.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаданияКЗакрытиюМесяца КАК ЗаданияКЗакрытиюМесяца
	|		ПО ПрочиеДоходыОбороты.Период = ЗаданияКЗакрытиюМесяца.Месяц
	|			И ПрочиеДоходыОбороты.Организация = ЗаданияКЗакрытиюМесяца.Организация
	|			И ЗаданияКЗакрытиюМесяца.Операция = ЗНАЧЕНИЕ(Справочник.ОперацииЗакрытияМесяца.РаспределениеДоходовПоНаправлениямДеятельности)
	|ГДЕ
	|	ЗаданияКЗакрытиюМесяца.Месяц ЕСТЬ NULL
	|	И (НастройкаБлокировкиОтИзменений.ЗаблокироватьПо ЕСТЬ NULL
	|		ИЛИ ПрочиеДоходыОбороты.Период > НастройкаБлокировкиОтИзменений.ЗаблокироватьПо)
	|	И (ПрочиеДоходыОбороты.СуммаОборот <> 0
	|			ИЛИ ПрочиеДоходыОбороты.СуммаУпрОборот <> 0
	|			ИЛИ ПрочиеДоходыОбороты.СуммаРеглОборот <> 0)";
	
	ИзмеренияРегистра = Запрос.Выполнить().Выгрузить();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ИзмеренияРегистра, ДополнительныеПараметры);

КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПолноеИмяРегистра	= "РегистрНакопления.УдалитьПрочиеДоходы";
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
		Возврат;
	КонецЕсли;
	
	Регистраторы = ОбновляемыеДанные.ВыгрузитьКолонку("Регистратор");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдалитьПрочиеДоходы.Период КАК Период,
	|	УдалитьПрочиеДоходы.Регистратор КАК Регистратор,
	|	УдалитьПрочиеДоходы.Организация КАК Организация,
	|	УдалитьПрочиеДоходы.Подразделение КАК Подразделение,
	|	УдалитьПрочиеДоходы.НаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.СтатьяДоходов КАК СтатьяДоходов,
	|	УдалитьПрочиеДоходы.АналитикаДоходов КАК АналитикаДоходов,
	|	ВЫБОР КОГДА УдалитьПрочиеДоходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -УдалитьПрочиеДоходы.Сумма
	|		ИНАЧЕ УдалитьПрочиеДоходы.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР КОГДА УдалитьПрочиеДоходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -УдалитьПрочиеДоходы.СуммаРегл
	|		ИНАЧЕ УдалитьПрочиеДоходы.СуммаРегл
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР
	|		КОГДА НЕ УдалитьПрочиеДоходы.СтатьяДоходов.ПринятиеКНалоговомуУчету
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл - СебестоимостьТоваров.ВременнаяРазница
	|				КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|					ТОГДА ДвиженияПоПрочимАктивамПассивам.СуммаРегл - ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница

	
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|				ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|			КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|				ТОГДА ДвиженияПоПрочимАктивамПассивам.ПостояннаяРазница

	
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	ВЫБОР
	|		КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|			ТОГДА ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница

	
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазница,
	|	ВЫБОР КОГДА УдалитьПрочиеДоходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА -УдалитьПрочиеДоходы.СуммаУпр
	|		ИНАЧЕ УдалитьПрочиеДоходы.СуммаУпр
	|	КОНЕЦ КАК СуммаУпр,
	|	УдалитьПрочиеДоходы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УдалитьПрочиеДоходы.РасчетСебестоимости КАК РасчетСебестоимости,
	|	УдалитьПрочиеДоходы.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	УдалитьПрочиеДоходы.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	УдалитьПрочиеДоходы.Сторно КАК Сторно,
	|	УдалитьПрочиеДоходы.ДокументРасчета КАК ДокументРасчета,
	|	УдалитьПрочиеДоходы.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	УдалитьПрочиеДоходы.ВидИсточника КАК ВидИсточника
	|ИЗ
	|	РегистрНакопления.УдалитьПрочиеДоходы КАК УдалитьПрочиеДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО УдалитьПрочиеДоходы.Регистратор = СебестоимостьТоваров.Регистратор
	|		И ((УдалитьПрочиеДоходы.ИдентификаторФинЗаписи <> """" И УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = СебестоимостьТоваров.ИдентификаторФинЗаписи)
	|			ИЛИ (УдалитьПрочиеДоходы.Подразделение = СебестоимостьТоваров.Подразделение
	|				И УдалитьПрочиеДоходы.Сумма = СебестоимостьТоваров.Стоимость
	|				И УдалитьПрочиеДоходы.СтатьяДоходов = СебестоимостьТоваров.СтатьяДоходов
	|				И УдалитьПрочиеДоходы.АналитикаДоходов = СебестоимостьТоваров.АналитикаДоходов))
	|			И УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации = СебестоимостьТоваров.НастройкаХозяйственнойОперации
	|			И УдалитьПрочиеДоходы.Сторно = СебестоимостьТоваров.Сторно
	|			И УдалитьПрочиеДоходы.Организация = СебестоимостьТоваров.Организация
	|			И (ЕСТЬNULL(СебестоимостьТоваров.ПостояннаяРазница, 0) <> 0
	|				ИЛИ ЕСТЬNULL(СебестоимостьТоваров.ВременнаяРазница, 0) <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияПоПрочимАктивамПассивам КАК ДвиженияПоПрочимАктивамПассивам
	|		ПО УдалитьПрочиеДоходы.Регистратор = ДвиженияПоПрочимАктивамПассивам.Регистратор
	|		И ((УдалитьПрочиеДоходы.ИдентификаторФинЗаписи <> """" И УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = ДвиженияПоПрочимАктивамПассивам.ИдентификаторФинЗаписи)
	|			ИЛИ (УдалитьПрочиеДоходы.Подразделение = ДвиженияПоПрочимАктивамПассивам.Подразделение
	|				И УдалитьПрочиеДоходы.Сумма = ДвиженияПоПрочимАктивамПассивам.СуммаРегл))
	|			И УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации = ДвиженияПоПрочимАктивамПассивам.НастройкаХозяйственнойОперации
	|			И УдалитьПрочиеДоходы.Сторно = ДвиженияПоПрочимАктивамПассивам.Сторно
	|			И УдалитьПрочиеДоходы.Организация = ДвиженияПоПрочимАктивамПассивам.Организация
	|			И (ЕСТЬNULL(ДвиженияПоПрочимАктивамПассивам.ПостояннаяРазница, 0) <> 0
	|				ИЛИ ЕСТЬNULL(ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница, 0) <> 0)

	
	|ГДЕ
	|	УдалитьПрочиеДоходы.Регистратор В (&Регистраторы)
	|	И НЕ УдалитьПрочиеДоходы.Регистратор ССЫЛКА Документ.РаспределениеДоходовПоНаправлениямДеятельности
	|	И НЕ УдалитьПрочиеДоходы.Регистратор ССЫЛКА Документ.ПрочиеДоходыРасходы
	//++ Локализация

	
	//-- Локализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдалитьПрочиеДоходы.Период КАК Период,
	|	УдалитьПрочиеДоходы.Регистратор,
	|	УдалитьПрочиеДоходы.Организация КАК Организация,
	|	УдалитьПрочиеДоходы.Подразделение КАК Подразделение,
	|	УдалитьПрочиеДоходы.НаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.СтатьяДоходов КАК СтатьяДоходов,
	|	УдалитьПрочиеДоходы.АналитикаДоходов КАК АналитикаДоходов,
	|	УдалитьПрочиеДоходы.Сумма КАК Сумма,
	|	УдалитьПрочиеДоходы.СуммаРегл КАК СуммаРегл,
	|	ПрочиеДоходы.ПостояннаяРазница,
	|	ПрочиеДоходы.ВременнаяРазница,
	|	УдалитьПрочиеДоходы.СуммаУпр КАК СуммаУпр,
	|	УдалитьПрочиеДоходы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УдалитьПрочиеДоходы.РасчетСебестоимости КАК РасчетСебестоимости,
	|	УдалитьПрочиеДоходы.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	УдалитьПрочиеДоходы.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	УдалитьПрочиеДоходы.Сторно КАК Сторно,
	|	УдалитьПрочиеДоходы.ДокументРасчета КАК ДокументРасчета,
	|	УдалитьПрочиеДоходы.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	УдалитьПрочиеДоходы.ВидИсточника КАК ВидИсточника
	|ИЗ
	|	РегистрНакопления.УдалитьПрочиеДоходы КАК УдалитьПрочиеДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрочиеДоходыРасходы.ПрочиеДоходы КАК ПрочиеДоходы
	|		ПО УдалитьПрочиеДоходы.Регистратор = ПрочиеДоходы.Ссылка
	|			И (УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = ПрочиеДоходы.ИдентификаторСтроки
	|					И ПрочиеДоходы.ИдентификаторСтроки <> """"
	|				ИЛИ УдалитьПрочиеДоходы.Подразделение = ПрочиеДоходы.Подразделение
	|					И УдалитьПрочиеДоходы.СтатьяДоходов = ПрочиеДоходы.СтатьяДоходов
	|					И УдалитьПрочиеДоходы.АналитикаДоходов = ПрочиеДоходы.АналитикаДоходов
	|					И УдалитьПрочиеДоходы.Сумма = ПрочиеДоходы.Сумма)
	|ГДЕ
	|	УдалитьПрочиеДоходы.Регистратор В (&Регистраторы)
	|	И УдалитьПрочиеДоходы.Регистратор ССЫЛКА Документ.ПрочиеДоходыРасходы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдалитьПрочиеДоходы.Период КАК Период,
	|	УдалитьПрочиеДоходы.Регистратор,
	|	УдалитьПрочиеДоходы.Организация КАК Организация,
	|	УдалитьПрочиеДоходы.Подразделение КАК Подразделение,
	|	УдалитьПрочиеДоходы.НаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.СтатьяДоходов КАК СтатьяДоходов,
	|	УдалитьПрочиеДоходы.АналитикаДоходов КАК АналитикаДоходов,
	|	-УдалитьПрочиеДоходы.Сумма КАК Сумма,
	|	-УдалитьПрочиеДоходы.СуммаРегл КАК СуммаРегл,
	|	-ВЫБОР
	|		КОГДА НЕ УдалитьПрочиеДоходы.СтатьяДоходов.ПринятиеКНалоговомуУчету
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл - СебестоимостьТоваров.ВременнаяРазница
	|				КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|					ТОГДА ДвиженияПоПрочимАктивамПассивам.СуммаРегл - ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница

	
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|				ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|			КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|				ТОГДА ДвиженияПоПрочимАктивамПассивам.ПостояннаяРазница

	
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	-ВЫБОР
	|		КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|			ТОГДА ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница

	
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазница,
	|	-УдалитьПрочиеДоходы.СуммаУпр КАК СуммаУпр,
	|	УдалитьПрочиеДоходы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УдалитьПрочиеДоходы.РасчетСебестоимости КАК РасчетСебестоимости,
	|	УдалитьПрочиеДоходы.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	УдалитьПрочиеДоходы.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	УдалитьПрочиеДоходы.Сторно КАК Сторно,
	|	УдалитьПрочиеДоходы.ДокументРасчета КАК ДокументРасчета,
	|	УдалитьПрочиеДоходы.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	УдалитьПрочиеДоходы.ВидИсточника КАК ВидИсточника
	|ИЗ
	|	РегистрНакопления.УдалитьПрочиеДоходы КАК УдалитьПрочиеДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО УдалитьПрочиеДоходы.Регистратор = СебестоимостьТоваров.Регистратор
	|			И УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = СебестоимостьТоваров.ИдентификаторФинЗаписи
	|			И УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации = СебестоимостьТоваров.НастройкаХозяйственнойОперации
	|			И УдалитьПрочиеДоходы.Сторно = СебестоимостьТоваров.Сторно
	|			И УдалитьПрочиеДоходы.Организация = СебестоимостьТоваров.Организация
	|			И (ЕСТЬNULL(СебестоимостьТоваров.ПостояннаяРазница, 0) <> 0
	|				ИЛИ ЕСТЬNULL(СебестоимостьТоваров.ВременнаяРазница, 0) <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияПоПрочимАктивамПассивам КАК ДвиженияПоПрочимАктивамПассивам
	|		ПО УдалитьПрочиеДоходы.Регистратор = ДвиженияПоПрочимАктивамПассивам.Регистратор
	|			И УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = ДвиженияПоПрочимАктивамПассивам.ИдентификаторФинЗаписи
	|			И УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации = ДвиженияПоПрочимАктивамПассивам.НастройкаХозяйственнойОперации
	|			И УдалитьПрочиеДоходы.Сторно = ДвиженияПоПрочимАктивамПассивам.Сторно
	|			И УдалитьПрочиеДоходы.Организация = ДвиженияПоПрочимАктивамПассивам.Организация
	|			И (ЕСТЬNULL(ДвиженияПоПрочимАктивамПассивам.ПостояннаяРазница, 0) <> 0
	|				ИЛИ ЕСТЬNULL(ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница, 0) <> 0)

	
	|ГДЕ
	|	УдалитьПрочиеДоходы.Регистратор В (&Регистраторы)
	|	И УдалитьПрочиеДоходы.Регистратор ССЫЛКА Документ.РаспределениеДоходовПоНаправлениямДеятельности
	|	И НЕ УдалитьПрочиеДоходы.НаправлениеДеятельности = УдалитьПрочиеДоходы.КорНаправлениеДеятельности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдалитьПрочиеДоходы.Период КАК Период,
	|	УдалитьПрочиеДоходы.Регистратор,
	|	УдалитьПрочиеДоходы.Организация КАК Организация,
	|	УдалитьПрочиеДоходы.Подразделение КАК Подразделение,
	|	УдалитьПрочиеДоходы.КорНаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.СтатьяДоходов КАК СтатьяДоходов,
	|	УдалитьПрочиеДоходы.АналитикаДоходов КАК АналитикаДоходов,
	|	УдалитьПрочиеДоходы.Сумма КАК Сумма,
	|	УдалитьПрочиеДоходы.СуммаРегл КАК СуммаРегл,
	|	ВЫБОР
	|		КОГДА НЕ УдалитьПрочиеДоходы.СтатьяДоходов.ПринятиеКНалоговомуУчету
	|			ТОГДА ВЫБОР
	|				КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|					ТОГДА СебестоимостьТоваров.СтоимостьРегл - СебестоимостьТоваров.ВременнаяРазница
	|				КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|					ТОГДА ДвиженияПоПрочимАктивамПассивам.СуммаРегл - ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница
	
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|				ТОГДА СебестоимостьТоваров.ПостояннаяРазница
	|			КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|				ТОГДА ДвиженияПоПрочимАктивамПассивам.ПостояннаяРазница
	
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	ВЫБОР
	|		КОГДА НЕ СебестоимостьТоваров.Регистратор ЕСТЬ NULL
	|			ТОГДА СебестоимостьТоваров.ВременнаяРазница
	|		КОГДА НЕ ДвиженияПоПрочимАктивамПассивам.Регистратор ЕСТЬ NULL
	|			ТОГДА ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница
	
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВременнаяРазница,
	|	УдалитьПрочиеДоходы.СуммаУпр КАК СуммаУпр,
	|	УдалитьПрочиеДоходы.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	УдалитьПрочиеДоходы.РасчетСебестоимости КАК РасчетСебестоимости,
	|	УдалитьПрочиеДоходы.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	УдалитьПрочиеДоходы.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	УдалитьПрочиеДоходы.Сторно КАК Сторно,
	|	УдалитьПрочиеДоходы.ДокументРасчета КАК ДокументРасчета,
	|	УдалитьПрочиеДоходы.РежимЗакрытияМесяца КАК РежимЗакрытияМесяца,
	|	УдалитьПрочиеДоходы.ВидИсточника КАК ВидИсточника
	|ИЗ
	|	РегистрНакопления.УдалитьПрочиеДоходы КАК УдалитьПрочиеДоходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ПО УдалитьПрочиеДоходы.Регистратор = СебестоимостьТоваров.Регистратор
	|			И УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = СебестоимостьТоваров.ИдентификаторФинЗаписи
	|			И УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации = СебестоимостьТоваров.НастройкаХозяйственнойОперации
	|			И УдалитьПрочиеДоходы.Сторно = СебестоимостьТоваров.Сторно
	|			И УдалитьПрочиеДоходы.Организация = СебестоимостьТоваров.Организация
	|			И (ЕСТЬNULL(СебестоимостьТоваров.ПостояннаяРазница, 0) <> 0
	|				ИЛИ ЕСТЬNULL(СебестоимостьТоваров.ВременнаяРазница, 0) <> 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияПоПрочимАктивамПассивам КАК ДвиженияПоПрочимАктивамПассивам
	|		ПО УдалитьПрочиеДоходы.Регистратор = ДвиженияПоПрочимАктивамПассивам.Регистратор
	|			И УдалитьПрочиеДоходы.ИдентификаторФинЗаписи = ДвиженияПоПрочимАктивамПассивам.ИдентификаторФинЗаписи
	|			И УдалитьПрочиеДоходы.НастройкаХозяйственнойОперации = ДвиженияПоПрочимАктивамПассивам.НастройкаХозяйственнойОперации
	|			И УдалитьПрочиеДоходы.Сторно = ДвиженияПоПрочимАктивамПассивам.Сторно
	|			И УдалитьПрочиеДоходы.Организация = ДвиженияПоПрочимАктивамПассивам.Организация
	|			И (ЕСТЬNULL(ДвиженияПоПрочимАктивамПассивам.ПостояннаяРазница, 0) <> 0
	|				ИЛИ ЕСТЬNULL(ДвиженияПоПрочимАктивамПассивам.ВременнаяРазница, 0) <> 0)
	
	|ГДЕ
	|	УдалитьПрочиеДоходы.Регистратор В (&Регистраторы)
	|	И УдалитьПрочиеДоходы.Регистратор ССЫЛКА Документ.РаспределениеДоходовПоНаправлениямДеятельности
	|	И НЕ УдалитьПрочиеДоходы.НаправлениеДеятельности = УдалитьПрочиеДоходы.КорНаправлениеДеятельности
	|
	//++ Локализация

	
	//-- Локализация
	|ИТОГИ
	|ПО
	|	Регистратор";	

	ВыборкаРегистратор = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРегистратор.Следующий() Цикл
		
		Регистратор = ВыборкаРегистратор.Регистратор;
		ПричинаИсключения = "";
		Рекомендация = "";
	
		СписокОписаний = Новый Массив;
		СписокОписаний.Добавить(НСтр("ru = 'Не удалось выполнить заполнение регистра ""Прочие доходы"" по данным регистра ""(Не используется) Прочие доходы"".'"));
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.УдалитьПрочиеДоходы.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
				
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Перепроведите документ вручную.'");
			
			НаборЗаписей = РегистрыНакопления.ПрочиеДоходы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			Выборка = ВыборкаРегистратор.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
			КонецЦикла;
			
			ПричинаИсключения = "Запись";
			
			Если НаборЗаписей.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;
			СтарыйНаборЗаписей = РегистрыНакопления.УдалитьПрочиеДоходы.СоздатьНаборЗаписей();
			СтарыйНаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтарыйНаборЗаписей);

			СтруктураПоиска = Новый Структура("Регистратор", Регистратор);
			Строки = ОбновляемыеДанные.НайтиСтроки(СтруктураПоиска);
			Если Строки.Количество() > 0 Тогда
				ОбщегоНазначенияУТ.УдалитьСтрокиТаблицы(ОбновляемыеДанные, Строки);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Регистратор);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(Регистратор, Рекомендация, Параметры);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
	
	КонецЦикла;
	
	Если ОбновляемыеДанные.Количество() > 0 Тогда 
		Для Каждого Строка Из ОбновляемыеДанные Цикл 
			СтарыйНаборЗаписей = РегистрыНакопления.УдалитьПрочиеДоходы.СоздатьНаборЗаписей();
			СтарыйНаборЗаписей.Отбор.Регистратор.Установить(Строка.Регистратор);
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтарыйНаборЗаписей);
		КонецЦикла;
	КонецЕсли;

	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, "РегистрНакопления.УдалитьПрочиеДоходы");

КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_ЗаданияКЗакрытиюМесяца(Параметры) Экспорт

	ВыбранныеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	МетаданныеРегистра = Метаданные.РегистрыСведений.ЗаданияКЗакрытиюМесяца;
	ПолноеИмяРегистра= МетаданныеРегистра.ПолноеИмя();
	
	Для Каждого ТекущиеДанные Из ВыбранныеДанные Цикл
		Набор = РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьНаборЗаписей();
		Набор.Отбор.Месяц.Установить(ТекущиеДанные.Месяц);
		Набор.Отбор.Операция.Установить(ТекущиеДанные.Операция);
		Набор.Отбор.Организация.Установить(ТекущиеДанные.Организация);
		НачатьТранзакцию();
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			
			ЭлементБлокировки= БлокировкаДанных.Добавить(ПолноеИмяРегистра);
			ЭлементБлокировки.УстановитьЗначение("Месяц",   ТекущиеДанные.Месяц);
			ЭлементБлокировки.УстановитьЗначение("Операция", ТекущиеДанные.Операция);
			ЭлементБлокировки.УстановитьЗначение("Организация", ТекущиеДанные.Организация);
			
			БлокировкаДанных.Заблокировать();
			
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ТекущиеДанные);
			Запись.НомерЗадания = РегистрыСведений.ЗаданияКЗакрытиюМесяца.ПолучитьНомерЗадания();
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Набор);
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
